zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE247/iar/startup_MCXE247.s
        PUBWEAK Reserved48_IRQHandler
        PUBWEAK LPUART1_IRQHandler
        PUBWEAK LPUART1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART1_IRQHandler
        LDR     R0, =LPUART1_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved50_IRQHandler
        PUBWEAK LPUART2_IRQHandler
        PUBWEAK LPUART2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART2_IRQHandler
        LDR     R0, =LPUART2_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved52_IRQHandler
        PUBWEAK Reserved53_IRQHandler
        PUBWEAK Reserved54_IRQHandler
        PUBWEAK ADC0_IRQHandler
        PUBWEAK ADC1_IRQHandler
        PUBWEAK CMP0_IRQHandler
        PUBWEAK Reserved58_IRQHandler
        PUBWEAK Reserved59_IRQHandler
        PUBWEAK ERM_single_fault_IRQHandler
        PUBWEAK ERM_double_fault_IRQHandler
        PUBWEAK RTC_IRQHandler
        PUBWEAK RTC_Seconds_IRQHandler
        PUBWEAK LPIT0_Ch0_IRQHandler
        PUBWEAK LPIT0_Ch1_IRQHandler
        PUBWEAK LPIT0_Ch2_IRQHandler
        PUBWEAK LPIT0_Ch3_IRQHandler
        PUBWEAK PDB0_IRQHandler
        PUBWEAK Reserved69_IRQHandler
        PUBWEAK Reserved70_IRQHandler
        PUBWEAK I2S1_Tx_IRQHandler
        PUBWEAK I2S1_Tx_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
I2S1_Tx_IRQHandler
        LDR     R0, =I2S1_Tx_DriverIRQHandler
        BX      R0

        PUBWEAK I2S1_Rx_IRQHandler
        PUBWEAK I2S1_Rx_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
I2S1_Rx_IRQHandler
        LDR     R0, =I2S1_Rx_DriverIRQHandler
        BX      R0

        PUBWEAK SCG_IRQHandler
        PUBWEAK LPTMR0_IRQHandler
        PUBWEAK PORTA_IRQHandler
        PUBWEAK PORTB_IRQHandler
        PUBWEAK PORTC_IRQHandler
        PUBWEAK PORTD_IRQHandler
        PUBWEAK PORTE_IRQHandler
        PUBWEAK SWI_IRQHandler
        PUBWEAK QSPI_Ored_IRQHandler
        PUBWEAK QSPI_Ored_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
QSPI_Ored_IRQHandler
        LDR     R0, =QSPI_Ored_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved82_IRQHandler
        PUBWEAK Reserved83_IRQHandler
        PUBWEAK PDB1_IRQHandler
        PUBWEAK FLEXIO_IRQHandler
        PUBWEAK FLEXIO_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXIO_IRQHandler
        LDR     R0, =FLEXIO_DriverIRQHandler
        BX      R0

        PUBWEAK I2S0_Tx_IRQHandler
        PUBWEAK I2S0_Tx_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
I2S0_Tx_IRQHandler
        LDR     R0, =I2S0_Tx_DriverIRQHandler
        BX      R0

        PUBWEAK I2S0_Rx_IRQHandler
        PUBWEAK I2S0_Rx_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
I2S0_Rx_IRQHandler
        LDR     R0, =I2S0_Rx_DriverIRQHandler
        BX      R0

        PUBWEAK ENET_1588_Timer_IRQHandler
        PUBWEAK ENET_1588_Timer_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ENET_1588_Timer_IRQHandler
        LDR     R0, =ENET_1588_Timer_DriverIRQHandler
        BX      R0

        PUBWEAK ENET_Transmit_IRQHandler
        PUBWEAK ENET_Transmit_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ENET_Transmit_IRQHandler
        LDR     R0, =ENET_Transmit_DriverIRQHandler
        BX      R0

        PUBWEAK ENET_Receive_IRQHandler
        PUBWEAK ENET_Receive_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ENET_Receive_IRQHandler
        LDR     R0, =ENET_Receive_DriverIRQHandler
        BX      R0

        PUBWEAK ENET_Error_IRQHandler
        PUBWEAK ENET_Error_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ENET_Error_IRQHandler
        LDR     R0, =ENET_Error_DriverIRQHandler
        BX      R0

        PUBWEAK ENET_Graceful_Stop_IRQHandler
        PUBWEAK ENET_Graceful_Stop_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ENET_Graceful_Stop_IRQHandler
        LDR     R0, =ENET_Graceful_Stop_DriverIRQHandler
        BX      R0

        PUBWEAK ENET_Wake_IRQHandler
        PUBWEAK ENET_Wake_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ENET_Wake_IRQHandler
        LDR     R0, =ENET_Wake_DriverIRQHandler
        BX      R0

        PUBWEAK CAN0_ORed_IRQHandler
        PUBWEAK CAN0_ORed_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN0_ORed_IRQHandler
        LDR     R0, =CAN0_ORed_DriverIRQHandler
        BX      R0

        PUBWEAK CAN0_Error_IRQHandler
        PUBWEAK CAN0_Error_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN0_Error_IRQHandler
        LDR     R0, =CAN0_Error_DriverIRQHandler
        BX      R0

        PUBWEAK CAN0_Wake_Up_IRQHandler
        PUBWEAK CAN0_Wake_Up_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN0_Wake_Up_IRQHandler
        LDR     R0, =CAN0_Wake_Up_DriverIRQHandler
        BX      R0

        PUBWEAK CAN0_ORed_0_15_MB_IRQHandler
        PUBWEAK CAN0_ORed_0_15_MB_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN0_ORed_0_15_MB_IRQHandler
        LDR     R0, =CAN0_ORed_0_15_MB_DriverIRQHandler
        BX      R0

        PUBWEAK CAN0_ORed_16_31_MB_IRQHandler
        PUBWEAK CAN0_ORed_16_31_MB_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN0_ORed_16_31_MB_IRQHandler
        LDR     R0, =CAN0_ORed_16_31_MB_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved99_IRQHandler
        PUBWEAK Reserved100_IRQHandler
        PUBWEAK CAN1_ORed_IRQHandler
        PUBWEAK CAN1_ORed_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN1_ORed_IRQHandler
        LDR     R0, =CAN1_ORed_DriverIRQHandler
        BX      R0

        PUBWEAK CAN1_Error_IRQHandler
        PUBWEAK CAN1_Error_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN1_Error_IRQHandler
        LDR     R0, =CAN1_Error_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved103_IRQHandler
        PUBWEAK CAN1_ORed_0_15_MB_IRQHandler
        PUBWEAK CAN1_ORed_0_15_MB_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN1_ORed_0_15_MB_IRQHandler
        LDR     R0, =CAN1_ORed_0_15_MB_DriverIRQHandler
        BX      R0

        PUBWEAK CAN1_ORed_16_31_MB_IRQHandler
        PUBWEAK CAN1_ORed_16_31_MB_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN1_ORed_16_31_MB_IRQHandler
        LDR     R0, =CAN1_ORed_16_31_MB_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved106_IRQHandler
        PUBWEAK Reserved107_IRQHandler
        PUBWEAK CAN2_ORed_IRQHandler
        PUBWEAK CAN2_ORed_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN2_ORed_IRQHandler
        LDR     R0, =CAN2_ORed_DriverIRQHandler
        BX      R0

