zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE247/iar/startup_MCXE247.s
        PUBWEAK CAN2_Error_IRQHandler
        PUBWEAK CAN2_Error_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN2_Error_IRQHandler
        LDR     R0, =CAN2_Error_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved110_IRQHandler
        PUBWEAK CAN2_ORed_0_15_MB_IRQHandler
        PUBWEAK CAN2_ORed_0_15_MB_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN2_ORed_0_15_MB_IRQHandler
        LDR     R0, =CAN2_ORed_0_15_MB_DriverIRQHandler
        BX      R0

        PUBWEAK CAN2_ORed_16_31_MB_IRQHandler
        PUBWEAK CAN2_ORed_16_31_MB_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN2_ORed_16_31_MB_IRQHandler
        LDR     R0, =CAN2_ORed_16_31_MB_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved113_IRQHandler
        PUBWEAK Reserved114_IRQHandler
        PUBWEAK FTM0_Ch0_Ch1_IRQHandler
        PUBWEAK FTM0_Ch2_Ch3_IRQHandler
        PUBWEAK FTM0_Ch4_Ch5_IRQHandler
        PUBWEAK FTM0_Ch6_Ch7_IRQHandler
        PUBWEAK FTM0_Fault_IRQHandler
        PUBWEAK FTM0_Ovf_Reload_IRQHandler
        PUBWEAK FTM1_Ch0_Ch1_IRQHandler
        PUBWEAK FTM1_Ch2_Ch3_IRQHandler
        PUBWEAK FTM1_Ch4_Ch5_IRQHandler
        PUBWEAK FTM1_Ch6_Ch7_IRQHandler
        PUBWEAK FTM1_Fault_IRQHandler
        PUBWEAK FTM1_Ovf_Reload_IRQHandler
        PUBWEAK FTM2_Ch0_Ch1_IRQHandler
        PUBWEAK FTM2_Ch2_Ch3_IRQHandler
        PUBWEAK FTM2_Ch4_Ch5_IRQHandler
        PUBWEAK FTM2_Ch6_Ch7_IRQHandler
        PUBWEAK FTM2_Fault_IRQHandler
        PUBWEAK FTM2_Ovf_Reload_IRQHandler
        PUBWEAK FTM3_Ch0_Ch1_IRQHandler
        PUBWEAK FTM3_Ch2_Ch3_IRQHandler
        PUBWEAK FTM3_Ch4_Ch5_IRQHandler
        PUBWEAK FTM3_Ch6_Ch7_IRQHandler
        PUBWEAK FTM3_Fault_IRQHandler
        PUBWEAK FTM3_Ovf_Reload_IRQHandler
        PUBWEAK FTM4_Ch0_Ch1_IRQHandler
        PUBWEAK FTM4_Ch2_Ch3_IRQHandler
        PUBWEAK FTM4_Ch4_Ch5_IRQHandler
        PUBWEAK FTM4_Ch6_Ch7_IRQHandler
        PUBWEAK FTM4_Fault_IRQHandler
        PUBWEAK FTM4_Ovf_Reload_IRQHandler
        PUBWEAK FTM5_Ch0_Ch1_IRQHandler
        PUBWEAK FTM5_Ch2_Ch3_IRQHandler
        PUBWEAK FTM5_Ch4_Ch5_IRQHandler
        PUBWEAK FTM5_Ch6_Ch7_IRQHandler
        PUBWEAK FTM5_Fault_IRQHandler
        PUBWEAK FTM5_Ovf_Reload_IRQHandler
        PUBWEAK FTM6_Ch0_Ch1_IRQHandler
        PUBWEAK FTM6_Ch2_Ch3_IRQHandler
        PUBWEAK FTM6_Ch4_Ch5_IRQHandler
        PUBWEAK FTM6_Ch6_Ch7_IRQHandler
        PUBWEAK FTM6_Fault_IRQHandler
        PUBWEAK FTM6_Ovf_Reload_IRQHandler
        PUBWEAK FTM7_Ch0_Ch1_IRQHandler
        PUBWEAK FTM7_Ch2_Ch3_IRQHandler
        PUBWEAK FTM7_Ch4_Ch5_IRQHandler
        PUBWEAK FTM7_Ch6_Ch7_IRQHandler
        PUBWEAK FTM7_Fault_IRQHandler
        PUBWEAK FTM7_Ovf_Reload_IRQHandler
        PUBWEAK DefaultISR
        SECTION .text:CODE:REORDER:NOROOT(1)
DMA0_DriverIRQHandler
DMA1_DriverIRQHandler
DMA2_DriverIRQHandler
DMA3_DriverIRQHandler
DMA4_DriverIRQHandler
DMA5_DriverIRQHandler
DMA6_DriverIRQHandler
DMA7_DriverIRQHandler
DMA8_DriverIRQHandler
DMA9_DriverIRQHandler
DMA10_DriverIRQHandler
DMA11_DriverIRQHandler
DMA12_DriverIRQHandler
DMA13_DriverIRQHandler
DMA14_DriverIRQHandler
DMA15_DriverIRQHandler
DMA_Error_DriverIRQHandler
MCM_IRQHandler
FTFC_CMD_IRQHandler
FTFC_Read_Collision_IRQHandler
LVD_LVW_IRQHandler
FTFM_Fault_IRQHandler
WDOG_EWM_IRQHandler
RCM_IRQHandler
LPI2C0_Master_DriverIRQHandler
LPI2C0_Slave_DriverIRQHandler
LPSPI0_DriverIRQHandler
LPSPI1_DriverIRQHandler
LPSPI2_DriverIRQHandler
LPI2C1_Master_DriverIRQHandler
LPI2C1_Slave_DriverIRQHandler
LPUART0_DriverIRQHandler
Reserved48_IRQHandler
LPUART1_DriverIRQHandler
Reserved50_IRQHandler
LPUART2_DriverIRQHandler
Reserved52_IRQHandler
Reserved53_IRQHandler
Reserved54_IRQHandler
ADC0_IRQHandler
ADC1_IRQHandler
CMP0_IRQHandler
Reserved58_IRQHandler
Reserved59_IRQHandler
ERM_single_fault_IRQHandler
ERM_double_fault_IRQHandler
RTC_IRQHandler
RTC_Seconds_IRQHandler
LPIT0_Ch0_IRQHandler
LPIT0_Ch1_IRQHandler
LPIT0_Ch2_IRQHandler
LPIT0_Ch3_IRQHandler
PDB0_IRQHandler
Reserved69_IRQHandler
Reserved70_IRQHandler
I2S1_Tx_DriverIRQHandler
I2S1_Rx_DriverIRQHandler
SCG_IRQHandler
LPTMR0_IRQHandler
PORTA_IRQHandler
PORTB_IRQHandler
PORTC_IRQHandler
PORTD_IRQHandler
PORTE_IRQHandler
SWI_IRQHandler
QSPI_Ored_DriverIRQHandler
Reserved82_IRQHandler
Reserved83_IRQHandler
PDB1_IRQHandler
FLEXIO_DriverIRQHandler
I2S0_Tx_DriverIRQHandler
I2S0_Rx_DriverIRQHandler
ENET_1588_Timer_DriverIRQHandler
ENET_Transmit_DriverIRQHandler
ENET_Receive_DriverIRQHandler
ENET_Error_DriverIRQHandler
ENET_Graceful_Stop_DriverIRQHandler
ENET_Wake_DriverIRQHandler
CAN0_ORed_DriverIRQHandler
CAN0_Error_DriverIRQHandler
CAN0_Wake_Up_DriverIRQHandler
CAN0_ORed_0_15_MB_DriverIRQHandler
CAN0_ORed_16_31_MB_DriverIRQHandler
Reserved99_IRQHandler
Reserved100_IRQHandler
CAN1_ORed_DriverIRQHandler
CAN1_Error_DriverIRQHandler
Reserved103_IRQHandler
CAN1_ORed_0_15_MB_DriverIRQHandler
CAN1_ORed_16_31_MB_DriverIRQHandler
Reserved106_IRQHandler
Reserved107_IRQHandler
CAN2_ORed_DriverIRQHandler
CAN2_Error_DriverIRQHandler
Reserved110_IRQHandler
CAN2_ORed_0_15_MB_DriverIRQHandler
CAN2_ORed_16_31_MB_DriverIRQHandler
Reserved113_IRQHandler
Reserved114_IRQHandler
FTM0_Ch0_Ch1_IRQHandler
FTM0_Ch2_Ch3_IRQHandler
FTM0_Ch4_Ch5_IRQHandler
FTM0_Ch6_Ch7_IRQHandler
FTM0_Fault_IRQHandler
FTM0_Ovf_Reload_IRQHandler
FTM1_Ch0_Ch1_IRQHandler
FTM1_Ch2_Ch3_IRQHandler
FTM1_Ch4_Ch5_IRQHandler
FTM1_Ch6_Ch7_IRQHandler
FTM1_Fault_IRQHandler
FTM1_Ovf_Reload_IRQHandler
FTM2_Ch0_Ch1_IRQHandler
FTM2_Ch2_Ch3_IRQHandler
FTM2_Ch4_Ch5_IRQHandler
FTM2_Ch6_Ch7_IRQHandler
FTM2_Fault_IRQHandler
FTM2_Ovf_Reload_IRQHandler
FTM3_Ch0_Ch1_IRQHandler
FTM3_Ch2_Ch3_IRQHandler
FTM3_Ch4_Ch5_IRQHandler
FTM3_Ch6_Ch7_IRQHandler
FTM3_Fault_IRQHandler
FTM3_Ovf_Reload_IRQHandler
FTM4_Ch0_Ch1_IRQHandler
FTM4_Ch2_Ch3_IRQHandler
FTM4_Ch4_Ch5_IRQHandler
FTM4_Ch6_Ch7_IRQHandler
FTM4_Fault_IRQHandler
FTM4_Ovf_Reload_IRQHandler
FTM5_Ch0_Ch1_IRQHandler
FTM5_Ch2_Ch3_IRQHandler
FTM5_Ch4_Ch5_IRQHandler
FTM5_Ch6_Ch7_IRQHandler
FTM5_Fault_IRQHandler
FTM5_Ovf_Reload_IRQHandler
FTM6_Ch0_Ch1_IRQHandler
FTM6_Ch2_Ch3_IRQHandler
FTM6_Ch4_Ch5_IRQHandler
FTM6_Ch6_Ch7_IRQHandler
FTM6_Fault_IRQHandler
FTM6_Ovf_Reload_IRQHandler
FTM7_Ch0_Ch1_IRQHandler
FTM7_Ch2_Ch3_IRQHandler
FTM7_Ch4_Ch5_IRQHandler
FTM7_Ch6_Ch7_IRQHandler
FTM7_Fault_IRQHandler
FTM7_Ovf_Reload_IRQHandler
DefaultISR
        B DefaultISR

        END
